#include <iostream>
#include <Windows.h>

using namespace std;
int sum(int x, int y) { return x + y; };

int(*f) (int, int);

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	//4
	bool a41 = false; //0x00
	bool a42 = true;  //0x01

	//5,6
	char a5 = 'l'; //0x6C
	char a6 = 'л'; //0xEB
	//7,8
	wchar_t a7 = L'g';//0x0067
	wchar_t a8 = L'г';//0x0433
	//9
	short a91 = 12; //0x000с 
	short a92 = -12; //0xfff4 1000 1100(пк) = 0111 0011(ок) = 0111 0100(дк)
	//10
	short a101 = 0x7FFF; //32767(10)=111111111111111(2)=0x7FFF(16)
	short a102 = 0x8000; //-32768(10)=-1000000000000000(2)=0x8000(16)
	//11
	unsigned short a111 = 0x0000;//0
	unsigned short a112 = 0xFFFF;//1111 1111 1111 1111(2) = 65535(10)
	//12
	int a121 = 13; //0x0000 000d
	int a122 = -13; //1000 1101(пк) = 0111 0010(ок) = 0111 0011(дк) 0xffff fff3
	//13
	int a131 = 0x80000000;//-2147483647(10) = 0111 1111 1111 1111 1111 1111 1111 1111(пк) = 1000 0000 0000 0000 0000 0000 0000 0000(ок) = 1000 0000 0000 0000 0000 0000 0000 0001(дк)
	int a132 = 0x7FFFFFFF;//2147483647(10) = 0111 1111 1111 1111 1111 1111 1111 1111(2)
	//14
	unsigned int a141 = 0x00000000;//0
	unsigned int a142 = 0xffffffff; //4294967295 = 1111 1111 1111 1111 1111 1111 1111 1111
	//15
	long a151 = 14; //0x000E;
	long a152 = -14; //1000 1110(пк) = 0111 0001(ок) = 0111 0010(дк) 0xffff fff2
	//16
	long a161 = 0x80000000; //-2147483647 = 0111 1111 1111 1111 1111 1111 1111 1111(пк) = 1000 0000 0000 0000 0000 0000 0000 0000(ок) = 1000 0000 0000 0000 0000 0000 0000 0001(дк)
	long a162 = 0x7FFFFFFF; // 2147483647 = 0111 1111 1111 1111 1111 1111 1111 1111
	//17
	unsigned long a171 = 0x00000000; //0
	unsigned long a172 = 0xFFFFFFFF; //4294967295 = 1111 1111 1111 1111 1111 1111 1111 1111
	//18
	//4 = 100(2)  2<-  2+127 = 129 129 = 10000001(2) 0100 0000 1000 0000(IEEE 754)=40 80 00 00(16)
	//-4 1100 0000 1000 0000(IEEE 754)=C0 80 00 00(16)
	float a181 = 4.0f;//0x00408000
	float a182 = -4.0f;//0xC0800000
	//19
	float a191 = a181 / 0;
	float a192 = a182 / 0;
	float a193 = sqrt(-2.0f);
	//20
//Переменные
	char a201 = 'А';
	wchar_t a202 = L'А';
	short a203 = 3;
	int a204 = 30;
	float a205 = 3.5;
	double a206 = 3.0005;
	//Указатели
	char* p201 = &a201; //
	wchar_t* p202 = &a202; //
	short* p203 = &a203; //
	int* p204 = &a204;//
	float* p205 = &a205;//
	double* p206 = &a206;//
	//Увеличение на 3
	char* p2011 = p201 + 3; //sizeof(char) *3 // +3
	wchar_t* p2022 = p202 + 3; // sizeof(wchar_t) * 3 // +6
	short* p2033 = p203 + 3;
	int* p2044 = p204 + 3;
	float* p2055 = p205 + 3;
	double* p2066 = p206 + 3;
	//21
	f = sum;
	int a21 = f(1, 8);
	system("pause");
	return 0;
}